app/views/projects/_form.html.haml

      %h3 Files to Upload
    - unless @project.assets.count.eql?(0)
---
SELECT COUNT(*) FROM `assets` WHERE `assets`.`project_id` IS NULL