app/views/files/_work.html.haml

SELECT `assets`.* FROM `assets` WHERE `assets`.`project_id` = 1
---
  #w_cont.work_cont
    - @project.assets.each do |asset|