app/controllers/files_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    @project = Project.find(params[:id])